In [4]:
import pandas as pd
#import seaborn as sns

#%matplotlib inline

In [16]:
# Read in the titanic dataset as a pandas dataframe

my_df = pd.read_csv("/Users/xuanningmeng/Desktop/6105DS/Module1/Titanic_II.csv")

# Find out dimensions of the dataframe
my_df.shape

(418, 12)

In [9]:
my_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,1,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,1,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

From this dataset, how many passengers were male ?

In [11]:
male_df = my_df[my_df["Sex"] == "male"]
male_df.shape

(266, 12)

From this dataset, how many passengers were female ?

In [13]:
female_df = my_df[my_df["Sex"] == "female"]
female_df.shape

(152, 12)

How many male passengers survived the sinking ? (0 = No, 1 = Yes)

In [14]:
male_df[male_df["Survived"] == 1].shape

(109, 12)

How many female passengers survived the sinking ?

In [15]:
female_df[female_df["Survived"] == 1].shape

(54, 12)

How many people above age 25 were in the ship at the time of sinking ?

In [10]:
my_df[my_df["Age"] > 25].shape

(413, 12)

How many females below age 50 survived the sinking ?

In [11]:
age_50_df = female_df[female_df["Age"] < 50]
age_50_df[age_50_df["Survived"] == 1].shape

(177, 12)

In [13]:
new_df = (female_df[(female_df["Age"] < 50) & (female_df["Survived"] == 1)]).shape
new_df

(177, 12)

How many people who travelled Pclass 1 survived ?

In [14]:
pclass_1_df = my_df[my_df["Pclass"] == 1]
pclass_1_df.shape

(216, 12)

In [15]:
pclass_1_df[pclass_1_df["Survived"] == 1].shape

(136, 12)

How many people who travelled Pclass 3 survived ?

In [19]:
pclass_3_df = my_df[my_df["Pclass"] == 3]
pclass_3_df.shape

(218, 12)

In [20]:
pclass_3_df[pclass_3_df["Survived"] == 1].shape

(87, 12)

Can you make a dataframe of all passengers sorted by their age ?

In [17]:
sorted_by_age = my_df.sort_values(by = "Age", inplace =  False)
sorted_by_age.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
354,1246,0,3,"Dean, Miss. Elizabeth Gladys Millvina""""",female,0.17,1,2,C.A. 2315,20.575,NaN,S
201,1093,0,3,"Danbom, Master. Gilbert Sigvard Emanuel",male,0.33,0,2,347080,14.400,NaN,S
281,1173,0,3,"Peacock, Master. Alfred Edward",male,0.75,1,1,SOTON/O.Q. 3101315,13.775,NaN,S
307,1199,1,3,"Aks, Master. Philip Frank",male,0.83,0,1,392091,9.350,NaN,S
250,1142,0,2,"West, Miss. Barbara J",female,0.92,1,2,C.A. 34651,27.750,NaN,S

How many people below age 20 survived the sinking ?

In [19]:
age_20_df = my_df[my_df["Age"] < 20]
age_20_df.shape

(164, 12)

In [20]:
age_20_df[age_20_df["Survived"] == 1].shape

(79, 12)